---
type: CitySet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# CitySet

`Autodesk.Revit.DB.CitySet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CitySet | — | `public CitySet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( City item )` |
| Method | Erase | — | `public virtual int Erase ( City item )` |
| Method | ForwardIterator | — | `public virtual CitySetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( City item )` |
| Method | ReverseIterator | — | `public virtual CitySetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |